* DONE Fix Issue Assignee so that it is a standalone heading
** There is a lot of work done on this
** I think it might actually be completely done but can't be sure

* DONE Fix milestone so that it isn't referred to as issue number
  CLOCK: [2015-05-16 Sat 11:04]--[2015-05-16 Sat 20:55] =>  9:51
* DONE Add Issues -> Document and Document -> Issues
** I actually figured  out how to do this in the existing test  
* DONE Fix inventory Search in backoffice
  CLOCK: [2015-05-13 Wed 13:26]--[2015-05-13 Wed 13:56] =>  0:30
 
* DONE Networking Report
  CLOCK: [2015-05-13 Wed 10:57]--[2015-05-13 Wed 13:26] =>  2:29
* DONE look up router pricing 
  CLOCK: [2015-05-06 Wed 13:15]--[2015-05-06 Wed 14:37] =>  1:22
  CLOCK: [2015-05-06 Wed 11:35]--[2015-05-06 Wed 11:50] =>  0:15

* DONE Get Stratix 8300 info
  CLOCK: [2015-05-06 Wed 16:36]--[2015-05-06 Wed 19:55] =>  3:19

* DONE Look over Kevin Howze's 5300 proposal
  CLOCK: [2015-05-11 Mon 13:20]--[2015-05-11 Mon 13:50] =>  0:30
* DONE Look over netsuite

** Chad
** TODO Assign all customers


** Yvonne

** TODO Forecast Type -remove

** TODO Opportunity 

** TODO Try to add Cost next to Sales Price

** TODO Find out what 'exclude from rate request'

** TODO Non-default available in the customer center

** TODO Maybe make it responsive

** TODO Workflow

   
** Kevin

** TODO Per foot price on Cable
  CLOCK: [2015-05-10 Sun 09:48]--[2015-05-10 Sun 09:48] =>  0:00
* TODO look over timelne for Rockwell Vmonitor
  
